app/controllers/restaurants_controller.rb

SELECT `restaurants`.* FROM `restaurants` WHERE (restaurant_name LIKE('%大阪%') or address LIKE('%大阪%'))
SELECT COUNT(*) FROM `restaurants` WHERE (restaurant_name LIKE('%大阪%') or address LIKE('%大阪%'))
SELECT COUNT(*) FROM `restaurants` WHERE (address LIKE '%大阪%')
SELECT `restaurants`.* FROM `restaurants`
SELECT COUNT(*) FROM `restaurants`
---
  def search
    # エリアとキーワード両方入力された場合
    if params[:area].present? && params[:keyword].present?
      @restaurants = Restaurant.where('address LIKE(?) and restaurant_name LIKE(?) or address LIKE(?)', "%#{params[:area]}%", "%#{params[:keyword]}%", "%#{params[:keyword]}%")
      @recordcount = Restaurant.where('address LIKE(?) and restaurant_name LIKE(?) or address LIKE(?)', "%#{params[:area]}%", "%#{params[:keyword]}%", "%#{params[:keyword]}%").count
    # エリアのみが入力された場合
    elsif params[:area].present?
      @restaurants = Restaurant.where('address LIKE ?', "%#{params[:area]}%")
      @recordcount = Restaurant.where('address LIKE ?', "%#{params[:area]}%").count
    # キーワードのみが入力された場合
    elsif params[:keyword].present?
      @restaurants = Restaurant.where('restaurant_name LIKE(?) or address LIKE(?)', "%#{params[:keyword]}%", "%#{params[:keyword]}%")
      @recordcount = Restaurant.where('restaurant_name LIKE(?) or address LIKE(?)', "%#{params[:keyword]}%", "%#{params[:keyword]}%").count
    # 何も入力せずに検索した場合
    else
      @restaurants = Restaurant.all
      @recordcount = Restaurant.count

INSERT INTO `restaurants` (`restaurant_name`, `tel`, `zipcode`, `address`, `registered_user_id`, `created_at`, `updated_at`, `restaurant_image`) VALUES ('テスト店舗2（写真付き）', '0427778888', '194-0004', '東京都町田市鶴間1032-1-000', 3, '2022-01-14 02:12:28', '2022-01-14 02:12:28', 'publicdomainq-0013273krm.jpg')
---
  def create
    @restaurant = Restaurant.new(restaurant_param)
    if @restaurant.save

SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def show
    @restaurant = Restaurant.find(params[:id])