app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`registered_user_id` = 3
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 3
---
  def show
    @user = User.find(current_user.id)
    @restaurants = Restaurant.where(registered_user_id: @user.id)
    @reviews = Review.where(user_id: current_user.id)